# -*- coding: utf-8 -*-
"""
Created on Sat Feb 25 14:20:33 2017

@author: natasha1_Yang
"""

#若分布函数F(x) = p(X <= x) = 1/(1 + exp(-(x-u)/r))
#则密度函数f(x) = F`(x) = exp(-(x-u)/r)/r(1 + exp(-(x-u)/r))^2
#可以使用链式法则来推导
#P(Y=1|X)= exp(w·x) / (1 + exp(w·x))
#P(Y=0|X)= 1 / (1 + exp(w·x))
#逻辑斯蒂回归模型就是输出Y=1(输出指定类别)的对数几率是由输入X的线性函数表示的模型
#熵是对不确定性的一种测量(熵越大，则无序程度越大),(0 <= H(P) <= log|X|)X服从均匀分布时，熵最大
#最大熵模型就是求最大条件熵
#求解:事件y1 y2 y3 y4 y5的最大熵模型
#P(y1) + P(y2) = 3/10;其中5者求和为1
#解:求max(H(p)) ==> min(-H(p)) ==> p(yi)log(p(yi))
#    只有两个约束条件,使用拉格朗日算法引入拉格朗日乘子
#    L = p(yi)log(p(yi))(i = 1,...,5) + r1(p(y1) + p(y2) - 3/10) + r0(p(yi)(i = 1,...,5) - 1)
#    根据对偶性,可以通过求解对偶最优化问题得到原始最优化问题的解
#    L对y1求导 = 1 +  p(y1) + r1 + r0 = 0 ==> p(y1)
#    同理对其他的事件求导等于0==>p(yi)
#    将求出的p(yi)带入L==>L1
#    L1对r1和r0求导等于0即可求出p(yi)
#IIS是一种最大熵学习模型的最优化算法  
#-loga >= 1 - a(a > 0)